#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/aws-terraform-cloud-dictionary/runs/run-9uxqUXveXgGoE9iH

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
module.lambda.data.archive_file.lambda_zip: Reading...
module.lambda.data.archive_file.lambda_zip: Read complete after 0s [id=808c13d893fbfdb2a60b23924bce0395771674c6]
module.api.aws_api_gateway_rest_api.dictionary_api: Refreshing state... [id=mxzztbhpe8]
module.lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=cloud_dictionary_lambda_role]
module.database.aws_dynamodb_table.dictionary_table: Refreshing state... [id=CloudDictionary]
module.api.aws_api_gateway_resource.search: Refreshing state... [id=bi7wdh]
module.api.aws_api_gateway_method.get_term: Refreshing state... [id=agm-mxzztbhpe8-bi7wdh-GET]
module.database.aws_dynamodb_table_item.dictionary_items["EC2"]: Refreshing state... [id=CloudDictionary|Term|EC2]
module.database.aws_dynamodb_table_item.dictionary_items["Auto Scaling"]: Refreshing state... [id=CloudDictionary|Term|AUTO SCALING]
module.database.aws_dynamodb_table_item.dictionary_items["Fargate"]: Refreshing state... [id=CloudDictionary|Term|FARGATE]
module.database.aws_dynamodb_table_item.dictionary_items["Route 53"]: Refreshing state... [id=CloudDictionary|Term|ROUTE 53]
module.database.aws_dynamodb_table_item.dictionary_items["SQS"]: Refreshing state... [id=CloudDictionary|Term|SQS]
module.database.aws_dynamodb_table_item.dictionary_items["CodePipeline"]: Refreshing state... [id=CloudDictionary|Term|CODEPIPELINE]
module.database.aws_dynamodb_table_item.dictionary_items["S3"]: Refreshing state... [id=CloudDictionary|Term|S3]
module.database.aws_dynamodb_table_item.dictionary_items["RDS"]: Refreshing state... [id=CloudDictionary|Term|RDS]
module.database.aws_dynamodb_table_item.dictionary_items["SageMaker"]: Refreshing state... [id=CloudDictionary|Term|SAGEMAKER]
module.database.aws_dynamodb_table_item.dictionary_items["CloudFormation"]: Refreshing state... [id=CloudDictionary|Term|CLOUDFORMATION]
module.database.aws_dynamodb_table_item.dictionary_items["SNS"]: Refreshing state... [id=CloudDictionary|Term|SNS]
module.database.aws_dynamodb_table_item.dictionary_items["VPC"]: Refreshing state... [id=CloudDictionary|Term|VPC]
module.database.aws_dynamodb_table_item.dictionary_items["Lambda"]: Refreshing state... [id=CloudDictionary|Term|LAMBDA]
module.database.aws_dynamodb_table_item.dictionary_items["Elastic IP"]: Refreshing state... [id=CloudDictionary|Term|ELASTIC IP]
module.database.aws_dynamodb_table_item.dictionary_items["CloudWatch"]: Refreshing state... [id=CloudDictionary|Term|CLOUDWATCH]
module.database.aws_dynamodb_table_item.dictionary_items["Redshift"]: Refreshing state... [id=CloudDictionary|Term|REDSHIFT]
module.database.aws_dynamodb_table_item.dictionary_items["API Gateway"]: Refreshing state... [id=CloudDictionary|Term|API GATEWAY]
module.database.aws_dynamodb_table_item.dictionary_items["DynamoDB"]: Refreshing state... [id=CloudDictionary|Term|DYNAMODB]
module.database.aws_dynamodb_table_item.dictionary_items["Elastic Beanstalk"]: Refreshing state... [id=CloudDictionary|Term|ELASTIC BEANSTALK]
module.database.aws_dynamodb_table_item.dictionary_items["Step Functions"]: Refreshing state... [id=CloudDictionary|Term|STEP FUNCTIONS]
module.database.aws_dynamodb_table_item.dictionary_items["EFS"]: Refreshing state... [id=CloudDictionary|Term|EFS]
module.database.aws_dynamodb_table_item.dictionary_items["CloudTrail"]: Refreshing state... [id=CloudDictionary|Term|CLOUDTRAIL]
module.database.aws_dynamodb_table_item.dictionary_items["CloudFront"]: Refreshing state... [id=CloudDictionary|Term|CLOUDFRONT]
module.database.aws_dynamodb_table_item.dictionary_items["Route Table"]: Refreshing state... [id=CloudDictionary|Term|ROUTE TABLE]
module.database.aws_dynamodb_table_item.dictionary_items["EBS"]: Refreshing state... [id=CloudDictionary|Term|EBS]
module.database.aws_dynamodb_table_item.dictionary_items["Kinesis"]: Refreshing state... [id=CloudDictionary|Term|KINESIS]
module.database.aws_dynamodb_table_item.dictionary_items["Glacier"]: Refreshing state... [id=CloudDictionary|Term|GLACIER]
module.database.aws_dynamodb_table_item.dictionary_items["Internet Gateway"]: Refreshing state... [id=CloudDictionary|Term|INTERNET GATEWAY]
module.database.aws_dynamodb_table_item.dictionary_items["IAM"]: Refreshing state... [id=CloudDictionary|Term|IAM]
module.lambda.aws_iam_role_policy.lambda_dynamo_policy: Refreshing state... [id=cloud_dictionary_lambda_role:terraform-20260201094519472700000001]
module.database.aws_dynamodb_table_item.dictionary_items["NAT Gateway"]: Refreshing state... [id=CloudDictionary|Term|NAT GATEWAY]
module.lambda.aws_lambda_function.dictionary_handler: Refreshing state... [id=CloudDictionaryHandler]
module.lambda.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/CloudDictionaryHandler]
module.api.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api.aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-mxzztbhpe8-bi7wdh-GET]
module.api.aws_api_gateway_deployment.prod: Refreshing state... [id=cbm2d4]
module.api.aws_api_gateway_stage.prod: Refreshing state... [id=ags-mxzztbhpe8-prod]
module.lambda.aws_iam_role_policy.lambda_logging: Refreshing state... [id=cloud_dictionary_lambda_role:lambda_logging_policy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_api_gateway_integration.lambda_integration has changed
  ~ resource "aws_api_gateway_integration" "lambda_integration" {
      + cache_key_parameters    = []
        id                      = "agi-mxzztbhpe8-bi7wdh-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.api.aws_api_gateway_deployment.prod must be replaced
+/- resource "aws_api_gateway_deployment" "prod" {
      ~ created_date  = "2026-02-01T09:45:27Z" -> (known after apply)
      ~ description   = "Deployed via Terraform on 2026-02-01T09:45:27Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ap-southeast-1:871308866502:mxzztbhpe8/" -> (known after apply)
      ~ id            = "cbm2d4" -> (known after apply)
      ~ invoke_url    = "https://mxzztbhpe8.execute-api.ap-southeast-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "560002368e00bfca3c6e86342caec90f107fe61e" -> "f2029121d51060c3cdf9700fd993bc1082b9d1d5"
        }
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_api_gateway_method.get_term will be updated in-place
  ~ resource "aws_api_gateway_method" "get_term" {
        id                   = "agm-mxzztbhpe8-bi7wdh-GET"
      ~ request_parameters   = {
          + "method.request.querystring.term" = true
        }
      + request_validator_id = (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_method_settings.all will be created
  + resource "aws_api_gateway_method_settings" "all" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "mxzztbhpe8"
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = false
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.api.aws_api_gateway_request_validator.dictionary_validator will be created
  + resource "aws_api_gateway_request_validator" "dictionary_validator" {
      + id                          = (known after apply)
      + name                        = "search-validator"
      + rest_api_id                 = "mxzztbhpe8"
      + validate_request_body       = false
      + validate_request_parameters = true
    }

  # module.api.aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "cbm2d4" -> (known after apply)
        id                    = "ags-mxzztbhpe8-prod"
        tags                  = {}
      ~ xray_tracing_enabled  = false -> true
        # (13 unchanged attributes hidden)
    }

  # module.app.aws_amplify_app.dictionary_frontend will be created
  + resource "aws_amplify_app" "dictionary_frontend" {
      + access_token                = (sensitive value)
      + arn                         = (known after apply)
      + build_spec                  = <<-EOT
            version: 1
            frontend:
              phases:
                preBuild:
                  commands:
                    - cd frontend
                    - npm install --no-audit --no-fund --loglevel=error
                build:
                  commands:
                    - echo "REACT_APP_API_URL=$REACT_APP_API_URL" >> .env
                    - npm run build
              artifacts:
                baseDirectory: frontend/build
                files:
                  - '**/*'
              cache:
                paths:
                  - frontend/node_modules/**/*
        EOT
      + custom_headers              = (known after apply)
      + default_domain              = (known after apply)
      + enable_auto_branch_creation = true
      + environment_variables       = {
          + "AMPLIFY_DIFF_DEPLOY" = "false"
          + "NODE_VERSION"        = "20"
          + "REACT_APP_API_URL"   = "https://mxzztbhpe8.execute-api.ap-southeast-1.amazonaws.com/prod/search"
        }
      + id                          = (known after apply)
      + name                        = "cloud-dictionary-app"
      + platform                    = "WEB"
      + production_branch           = (known after apply)
      + repository                  = "https://github.com/ShenLoong99/aws-terraform-cloud-dictionary"
      + tags_all                    = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }

      + auto_branch_creation_config (known after apply)

      + cache_config (known after apply)
    }

  # module.app.aws_amplify_branch.main will be created
  + resource "aws_amplify_branch" "main" {
      + app_id               = (known after apply)
      + arn                  = (known after apply)
      + associated_resources = (known after apply)
      + branch_name          = "main"
      + custom_domains       = (known after apply)
      + destination_branch   = (known after apply)
      + display_name         = (known after apply)
      + enable_auto_build    = false
      + framework            = "React"
      + id                   = (known after apply)
      + source_branch        = (known after apply)
      + tags_all             = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }
    }

  # module.app.aws_amplify_webhook.build_webhook will be created
  + resource "aws_amplify_webhook" "build_webhook" {
      + app_id      = (known after apply)
      + arn         = (known after apply)
      + branch_name = "main"
      + description = "Triggered by Terraform Cloud"
      + id          = (known after apply)
      + url         = (known after apply)
    }

  # module.app.null_resource.curl_webhook will be created
  + resource "null_resource" "curl_webhook" {
      + id       = (known after apply)
      + triggers = {
          + "always_run" = (known after apply)
          + "env_vars"   = jsonencode(
                {
                  + AMPLIFY_DIFF_DEPLOY = "false"
                  + NODE_VERSION        = "20"
                  + REACT_APP_API_URL   = "https://mxzztbhpe8.execute-api.ap-southeast-1.amazonaws.com/prod/search"
                }
            )
        }
    }

  # module.lambda.aws_iam_role_policy.lambda_sqs_policy will be created
  + resource "aws_iam_role_policy" "lambda_sqs_policy" {
      + id          = (known after apply)
      + name        = "LambdaDLQPolicy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "cloud_dictionary_lambda_role"
    }

  # module.lambda.aws_lambda_function.dictionary_handler will be updated in-place
  ~ resource "aws_lambda_function" "dictionary_handler" {
        id                             = "CloudDictionaryHandler"
        tags                           = {}
        # (29 unchanged attributes hidden)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_sqs_queue.lambda_dlq will be created
  + resource "aws_sqs_queue" "lambda_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "CloudDictionary-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 9 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  + amplify_app_id      = (known after apply)
  + amplify_app_url     = (known after apply)
  + amplify_branch_name = "main"

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 8 estimated
           $0.0/mo +$0.0

```

</details>